package org.example.task3;

/**
 * ВНИМАНИЕ!!!
 * Все задания должны быть решены с использованием
 * объектного подхода. Создавать классы и работать с объектами. Соблюдать принцип инкапсуляции
 *
 * Задание 3
 * Создать класс Money (Деньги) для работы с денежными
 * суммами. Число должно быть представлено двумя полями:
 * ■ типа long – для гривен;
 * ■ типа byte – для копеек.
 * Реализовать вывод значения на экран, при этом дробная
 * часть должна быть отделена от целой части запятой. Реализовать сложение, вычитание, деление сумм, деление суммы
 * на дробное число, умножение на дробное число и операции
 * сравнения. Протестировать с использованием JUnit.
 */

public class Main {
}
