package org.example.task6;

/**
 * ВНИМАНИЕ!!!
 * Все задания должны быть решены с использованием
 * объектного подхода. Создавать классы и работать с объектами. Соблюдать принцип инкапсуляции
 *
 * Задание 6
 * В библиотеке решили автоматизировать учет книг, выданных студентам.
 * Студент, для того чтобы получить книгу, должен получить
 * читательский билет, если не получал ранее. В читательском
 * билете содержится информация:
 * ■ номер билета;
 * ■ фамилия и имя студента;
 * ■ номер группы.
 * При выдаче книги библиотекарь фиксирует в журнале:
 * ■ название и автора книги;
 * ■ номер билета, на который выдана книга;
 * ■ дата выдачи;
 * ■ на какое время выдана книга (в сутках).
 * При приеме книги библиотекарь фиксирует в журнале:
 * ■ название и автора книги;
 * ■ номер билета студента, который вернул книгу;
 * ■ дата возврата.
 * Разработать модель программы, которая бы позволила
 * находить должников (студентов, которые не сдали книгу вовремя).
 */

public class Main {
    public static void main(String[] args) {

    }
}
